// задача 3 - результата [1, 2, 1, 2, 5, 6, 7]

// вариант 1
// const a = [1, 2, 3, 4, 5, 6, 7]
// a[2] = 1;
// a[3] = 2;

// console.log(a)

// вариант 2
 
// const a = [1, 2, 3, 4, 5, 6, 7]
// a.copyWithin(2, 0, 2)

// console.log(a)

// вариант 3 результат- [1, 2, 3, 0, 0, 0, 7]>>>> splice 3-индекс первого числа, которое хотим заменить; 3- сколько чисел хотим заменить; 0,0,0- сами числа

// const a = [1, 2, 3, 4, 5, 6, 7]
// a.splice(3, 3, 0, 0, 0)     

// console.log(a)

// вариант 4 результат-[1, 2, 3, 0, 0, 0, 7] - fill - 3-6 - с какого по какое число нам нужно заменить

 const a = [1, 2, 3, 4, 5, 6, 7]
a.fill(0, 3, 6)     

console.log(a)